## Plan Result (stg_appgw)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg"
        name                              = "crime-portal-appgw-stg"
        tags                              = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "lncs-crimeportal-notify-uat.lncs.hmcs" -> null
          - id                                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendHttpSettingsCollection/crime-portal-behttps01-stg" -> null
          - name                                = "crime-portal-behttps01-stg" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 443 -> null
          - probe_id                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/probes/https" -> null
          - probe_name                          = "https" -> null
          - protocol                            = "Https" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [
              - "crime-portal-uat",
            ] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Enabled" -> null
          - host_name                           = "crimeportal.staging.apps.hmcts.net" -> null
          - id                                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendHttpSettingsCollection/crime-portal-behttp01-stg" -> null
          - name                                = "crime-portal-behttp01-stg" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/probes/http" -> null
          - probe_name                          = "http" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 60 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + host_name                           = "crimeportal.staging.apps.hmcts.net"
          + id                                  = (known after apply)
          + name                                = "crime-portal-behttp01-stg"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "http"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendIPConfigurations/crime-portal-private-stg" -> null
          - frontend_ip_configuration_name = "crime-portal-private-stg" -> null
          - frontend_port_id               = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-http-listener" -> null
          - name                           = "crime-portal-http-listener" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendIPConfigurations/crime-portal-private-stg" -> null
          - frontend_ip_configuration_name = "crime-portal-private-stg" -> null
          - frontend_port_id               = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-https-listener" -> null
          - name                           = "crime-portal-https-listener" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/sslCertificates/crime-portal-uat-ssl-cert" -> null
          - ssl_certificate_name           = "crime-portal-uat-ssl-cert" -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-stg"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-stg"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-https-listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "lets_encrypt"
          + ssl_profile_id                 = (known after apply)
        }

      - probe {
          - id                                        = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/probes/http" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "http" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }
      - probe {
          - id                                        = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/probes/https" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "https" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 443 -> null
          - protocol                                  = "Https" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }
      + probe {
          + id                                        = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/probes/http"
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "http"
          + path                                      = "/"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendAddressPools/crime-portal-bap01-stg" -> null
          - backend_address_pool_name  = "crime-portal-bap01-stg" -> null
          - backend_http_settings_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendHttpSettingsCollection/crime-portal-behttp01-stg" -> null
          - backend_http_settings_name = "crime-portal-behttp01-stg" -> null
          - http_listener_id           = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-http-listener" -> null
          - http_listener_name         = "crime-portal-http-listener" -> null
          - id                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/requestRoutingRules/crime-portal-http-rule" -> null
          - name                       = "crime-portal-http-rule" -> null
          - priority                   = 20 -> null
          - rewrite_rule_set_id        = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendAddressPools/crime-portal-bap01-stg" -> null
          - backend_address_pool_name  = "crime-portal-bap01-stg" -> null
          - backend_http_settings_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendHttpSettingsCollection/crime-portal-behttp01-stg" -> null
          - backend_http_settings_name = "crime-portal-behttp01-stg" -> null
          - http_listener_id           = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-https-listener" -> null
          - http_listener_name         = "crime-portal-https-listener" -> null
          - id                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/requestRoutingRules/crime-portal-https-rule" -> null
          - name                       = "crime-portal-https-rule" -> null
          - priority                   = 21 -> null
          - rewrite_rule_set_id        = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendAddressPools/crime-portal-bap01-stg"
          + backend_address_pool_name  = "crime-portal-bap01-stg"
          + backend_http_settings_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/backendHttpSettingsCollection/crime-portal-behttp01-stg"
          + backend_http_settings_name = "crime-portal-behttp01-stg"
          + http_listener_id           = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-http-listener"
          + http_listener_name         = "crime-portal-http-listener"
          + id                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/requestRoutingRules/crime-portal-http-rule"
          + name                       = "crime-portal-http-rule"
          + priority                   = 20
          + rewrite_rule_set_id        = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "crime-portal-bap01-stg"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "backend_http_settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "crime-portal-https-listener"
          + id                         = (known after apply)
          + name                       = "crime-portal-https-rule"
          + priority                   = 21
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/rewriteRuleSets/x_fwded_proto"
          ~ name = "x_fwded_proto" -> "crime-portal-rewrites"

          ~ rewrite_rule {
              ~ name          = "x_fwded_proto" -> "crime-portal-location-rewrite"
                # (1 unchanged attribute hidden)

              - request_header_configuration {
                  - header_name  = "X-Forwarded-Proto" -> null
                  - header_value = "https" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-Forwarded-Port" -> null
                  - header_value = "443" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-Forwarded-For" -> null
                  - header_value = "{var_add_x_forwarded_for_proxy}" -> null
                }

              + response_header_configuration {
                  + header_name  = "Location"
                  + header_value = "https://crimeportal.staging.apps.hmcts.net"
                }
            }
          - rewrite_rule {
              - name          = "location" -> null
              - rule_sequence = 100 -> null

              - response_header_configuration {
                  - header_name  = "Location" -> null
                  - header_value = "https://crimeportal.staging.apps.hmcts.net" -> null
                }
            }
        }
      + rewrite_rule_set {
          + name = "x_fwded_proto"

          + rewrite_rule {
              + name          = "x_fwded_proto"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-Proto"
                  + header_value = "https"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Port"
                  + header_value = "443"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_add_x_forwarded_for_proxy}"
                }
            }
        }

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (11 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":56,"Program":"tfcmt","SHA1":"","Target":"stg_appgw","Vars":{}} -->